In [4]:
import pandas as pd
url = 'https://github.com/laxmimerit/All-CSV-ML-DATA-Files-Download/raw/master/Data%20-%20Multiple%20Worksheets.xlsx'
df = pd.read_excel(url, sheet_name = 'Data 1')
df

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [5]:
import json

In [6]:
df.to_json('data/output.json', orient = 'records')

In [7]:
df.to_json('data/output1.json', orient = 'records', lines = True)

In [11]:
d1 = json.load(open('data/output.json'))
pd.DataFrame(d1)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [13]:
d1 = pd.read_json('data/output.json')
d1

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [14]:
df2 = pd.read_json('data/output1.json', lines=True)
df2

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

### Working with the nested json data

In [15]:
nested_data = {
        'passenger': {
                'name': 'bob',
                'age': 23,
                'ticket':{
                        'number':'23sdlfj',
                        'price':123
                }
        }
}

### How you read or show the nested json in the DataFrame

In [16]:
pd.json_normalize(nested_data)

,passenger.name,passenger.age,passenger.ticket.number,passenger.ticket.price
0,bob,23,23sdlfj,123